; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	thermograph1 - mode
	image3 - mode
	thermograph2 - mode
	image0 - mode
	Star2 - direction
	Star4 - direction
	GroundStation5 - direction
	GroundStation0 - direction
	Star1 - direction
	GroundStation3 - direction
	Star6 - direction
	Phenomenon7 - direction
	Star8 - direction
	Phenomenon9 - direction
	Star10 - direction
	Planet11 - direction
	Phenomenon12 - direction
	Planet13 - direction
	Planet14 - direction
	Phenomenon15 - direction
)
(:init
	(supports instrument0 image3)
	(supports instrument0 image0)
	(supports instrument0 thermograph2)
	(calibration_target instrument0 GroundStation0)
	(supports instrument1 image0)
	(supports instrument1 thermograph1)
	(supports instrument1 image3)
	(calibration_target instrument1 GroundStation3)
	(calibration_target instrument1 Star1)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Planet14)
)
(:goal (and
	(have_image Star6 thermograph1)
	(have_image Phenomenon7 image0)
	(have_image Star8 image0)
	(have_image Phenomenon9 thermograph1)
	(have_image Star10 image3)
	(have_image Planet11 image0)
	(have_image Phenomenon12 thermograph2)
	(have_image Planet13 thermograph2)
	(have_image Planet14 image0)
	(have_image Phenomenon15 image3)
))

)

; plan
1. (turn_to satellite0 groundstation3 planet14)
   deleted: (pointing satellite0 planet14)
   added: (pointing satellite0 groundstation3)
   goals met: 0 of 10
2. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 0 of 10
3. (calibrate satellite0 instrument1 groundstation3)
   added: (calibrated instrument1)
   goals met: 0 of 10
4. (turn_to satellite0 star6 groundstation3)
   deleted: (pointing satellite0 groundstation3)
   added: (pointing satellite0 star6)
   goals met: 0 of 10
5. (take_image satellite0 star6 instrument1 thermograph1)
   added: (have_image star6 thermograph1)
   goals met: 1 of 10
6. (turn_to satellite0 phenomenon9 star6)
   deleted: (pointing satellite0 star6)
   added: (pointing satellite0 phenomenon9)
   goals met: 1 of 10
7. (take_image satellite0 phenomenon9 instrument1 thermograph1)
   added: (have_image phenomenon9 thermograph1)
   goals met: 2 of 10
8. (turn_to satellite0 phenomenon15 phenomenon9)
   deleted: (pointing satellite0 phenomenon9)
   added: (pointing satellite0 phenomenon15)
   goals met: 2 of 10
9. (take_image satellite0 phenomenon15 instrument1 image3)
   added: (have_image phenomenon15 image3)
   goals met: 3 of 10
10. (turn_to satellite0 groundstation0 phenomenon15)
   deleted: (pointing satellite0 phenomenon15)
   added: (pointing satellite0 groundstation0)
   goals met: 3 of 10
11. (switch_off instrument1 satellite0)
   deleted: (power_on instrument1)
   added: (power_avail satellite0)
   goals met: 3 of 10
12. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 3 of 10
13. (calibrate satellite0 instrument0 groundstation0)
   added: (calibrated instrument0)
   goals met: 3 of 10
14. (turn_to satellite0 phenomenon12 groundstation0)
   deleted: (pointing satellite0 groundstation0)
   added: (pointing satellite0 phenomenon12)
   goals met: 3 of 10
15. (take_image satellite0 phenomenon12 instrument0 thermograph2)
   added: (have_image phenomenon12 thermograph2)
   goals met: 4 of 10
16. (turn_to satellite0 phenomenon7 phenomenon12)
   deleted: (pointing satellite0 phenomenon12)
   added: (pointing satellite0 phenomenon7)
   goals met: 4 of 10
17. (take_image satellite0 phenomenon7 instrument0 image0)
   added: (have_image phenomenon7 image0)
   goals met: 5 of 10
18. (turn_to satellite0 planet11 phenomenon7)
   deleted: (pointing satellite0 phenomenon7)
   added: (pointing satellite0 planet11)
   goals met: 5 of 10
19. (take_image satellite0 planet11 instrument0 image0)
   added: (have_image planet11 image0)
   goals met: 6 of 10
20. (turn_to satellite0 planet13 planet11)
   deleted: (pointing satellite0 planet11)
   added: (pointing satellite0 planet13)
   goals met: 6 of 10
21. (take_image satellite0 planet13 instrument0 thermograph2)
   added: (have_image planet13 thermograph2)
   goals met: 7 of 10
22. (turn_to satellite0 planet14 planet13)
   deleted: (pointing satellite0 planet13)
   added: (pointing satellite0 planet14)
   goals met: 7 of 10
23. (take_image satellite0 planet14 instrument0 image0)
   added: (have_image planet14 image0)
   goals met: 8 of 10
24. (turn_to satellite0 star10 planet14)
   deleted: (pointing satellite0 planet14)
   added: (pointing satellite0 star10)
   goals met: 8 of 10
25. (take_image satellite0 star10 instrument0 image3)
   added: (have_image star10 image3)
   goals met: 9 of 10
26. (turn_to satellite0 star8 star10)
   deleted: (pointing satellite0 star10)
   added: (pointing satellite0 star8)
   goals met: 9 of 10
27. (take_image satellite0 star8 instrument0 image0)
   added: (have_image star8 image0)
   goals met: 10 of 10
